In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('Tips.csv')

In [5]:
#CrossTabulation
crosstab = pd.crosstab(df['gender'],df['smoker'])
print("Crosstab of gender and smoker:\n",crosstab)

Crosstab of gender and smoker:
 smoker  No  Yes
gender
Female  54   33
Male    97   60

In [9]:
crosstab = pd.crosstab(df['gender'],df['day'])
print("Crosstab of gender and smoker:\n",crosstab)

Crosstab of gender and smoker:
 day     Fri  Sat  Sun  Thur
gender
Female    9   28   18    32
Male     10   59   58    30

In [11]:
crosstab = pd.crosstab(df['gender'],df['time'])
print("Crosstab of gender and smoker:\n",crosstab)

Crosstab of gender and smoker:
 time    Dinner  Lunch
gender
Female      52     35
Male       124     33

In [ ]:
#ERROR!! Uncommenting this will give error
#crosstab = pd.crosstab(df['gender'],df['time'],df['day'])

In [23]:
#Crosstab with aggregation: Sum of total_bill by gender and day
crosstab_total_bill = pd.crosstab(df['gender'],df['day'],values=df['total_bill'],aggfunc='sum')

In [25]:
crosstab_total_bill

day        Fri      Sat      Sun    Thur
gender
Female  127.31   551.05   357.70  534.89
Male    198.57  1227.35  1269.46  561.44

In [34]:
print("Sum of total bill by gender and day\n",crosstab_total_bill)

Sum of total bill by gender and day
 day        Fri      Sat      Sun    Thur
gender
Female  127.31   551.05   357.70  534.89
Male    198.57  1227.35  1269.46  561.44

In [39]:
#Crosstab with aggregation : average tip by gender and smoke
crosstab_avg_tip = pd.crosstab(df['gender'], df['smoker'], values=df['tip'], aggfunc='mean')
crosstab_avg_tip

smoker        No       Yes
gender
Female  2.773519  2.931515
Male    3.113402  3.051167

In [41]:
df['tip_percentage'] = (df['tip']/df['total_bill']) * 100
crosstab_max_tip_per = pd.crosstab(df['day'], df['time'], values= df['tip_percentage'], aggfunc='max')

In [43]:
crosstab_max_tip_per

time     Dinner      Lunch
day
Fri   26.348039  25.931446
Sat   32.573290        NaN
Sun   71.034483        NaN
Thur  15.974441  26.631158

# Students Performance

In [54]:
df1 = pd.read_csv('StudentsPerformance.csv')
df1

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [60]:
#Crosstabulations
crosstab = pd.crosstab(df1['race/ethnicity'], df1['test preparation course'])
crosstab

test preparation course  completed  none
race/ethnicity
group A                         31    58
group B                         68   122
group C                        117   202
group D                         82   180
group E                         60    80

In [66]:
#Crosstab with aggregation'
cross_tab_avg_marks = pd.crosstab(df1['race/ethnicity'], df1['test preparation course'],values = df1['math score'],aggfunc=['mean','max','min'])

In [68]:
cross_tab_avg_marks

                              mean                  max            min
test preparation course  completed       none completed none completed none
race/ethnicity
group A                  68.258065  58.086207       100   91        34   28
group B                  67.191176  61.368852        94   97        23    8
group C                  67.495726  62.707921        98   97        29    0
group D                  69.792683  66.255556       100   98        35   26
group E                  77.433333  71.112500       100  100        42   30